<?php

namespace Database\Seeders;

use App\Models\Game;
use App\Models\GameTranslation;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class GamesTableSeeder extends Seeder
{
    public function run(): void
    {
        $games = [
            [
                'id' => 5,
                'name' => 'أهلاً شات',
                'price' => 0.00038907544,
            ],
            [
                'id' => 7,
                'name' => 'لاما شات',
                'price' => 0.0003602352,
            ],
            [
                'id' => 8,
                'name' => 'يوهو واكا',
                'price' => 9.9521552e-5,
            ],
            [
                'id' => 9,
                'name' => 'ليغو لايف',
                'price' => 0.0012621336000000001,
            ],
            [
                'id' => 10,
                'name' => 'هيا شات',
                'price' => 0.0011158784,
            ],
            [
                'id' => 12,
                'name' => 'MeYo',
                'price' => 1.04,
            ],
            [
                'id' => 13,
                'name' => 'Aloparty',
                'price' => 1.04,
            ],
            [
                'id' => 15,
                'name' => 'بيلا شات',
                'price' => 0.00096296304,
            ],
            [
                'id' => 16,
                'name' => 'بارتي ستار',
                'price' => 0.0010855936000000001,
            ],
            [
                'id' => 17,
                'name' => 'آزال لايف',
                'price' => 0.00081889808,
            ],
            [
                'id' => 18,
                'name' => 'حكي شات',
                'price' => 0.00098765472,
            ],
            [
                'id' => 19,
                'name' => 'بوبو شات',
                'price' => 5.3608256e-5,
            ],
            [
                'id' => 20,
                'name' => 'هوا شات',
                'price' => 0.00102161072,
            ],
            [
                'id' => 21,
                'name' => 'لايت شات',
                'price' => 0.00033821112,
            ],
            [
                'id' => 22,
                'name' => 'ميكو لايف',
                'price' => 0.0015226952,
            ],
            [
                'id' => 23,
                'name' => 'أوهلا شات',
                'price' => 0.00076079016,
            ],
            [
                'id' => 26,
                'name' => 'تالك تالك',
                'price' => 0.00085737808,
            ],
            [
                'id' => 27,
                'name' => 'أب لايف',
                'price' => 0.01518244,
            ],
            [
                'id' => 30,
                'name' => '100 مجوهرة',
                'price' => 0.8528,
            ],
            [
                'id' => 33,
                'name' => 'Software خدمات',
                'price' => 1.04,
            ],
            [
                'id' => 34,
                'name' => 'Hago هاغو',
                'price' => 1.04,
            ],
            [
                'id' => 35,
                'name' => 'يويو شات',
                'price' => 0.0008012326400000001,
            ],
            [
                'id' => 36,
                'name' => '360 لايف يو',
                'price' => 1.04,
            ],
            [
                'id' => 38,
                'name' => 'لايكي لايف',
                'price' => 0.018571384,
            ],
            [
                'id' => 39,
                'name' => 'Bermuda برمودا',
                'price' => 1.04,
            ],
            [
                'id' => 41,
                'name' => 'اشتراك شاهد شهر واحد',
                'price' => 1.04,
            ],
            [
                'id' => 42,
                'name' => 'Nitflix نتفلكس',
                'price' => 1.04,
            ],
            [
                'id' => 43,
                'name' => 'اشتراك سنوي',
                'price' => 1.04,
            ],
            [
                'id' => 44,
                'name' => 'Tiktok تيكتوك',
                'price' => 1.04,
            ],
            [
                'id' => 47,
                'name' => 'Sigo سيغو',
                'price' => 1.04,
            ],
            [
                'id' => 48,
                'name' => 'فور فن',
                'price' => 6.265064000000001e-5,
            ],
            [
                'id' => 49,
                'name' => 'لامي شات',
                'price' => 0.0004202016,
            ],
            [
                'id' => 50,
                'name' => 'Binmo بينمو',
                'price' => 0.00044763902000000003,
            ],
            [
                'id' => 51,
                'name' => 'TURKCELL رصيد',
                'price' => 1.04,
            ],
            [
                'id' => 52,
                'name' => 'اشتراك شاهد  ثلاث اشهر',
                'price' => 1.04,
            ],
            [
                'id' => 53,
                'name' => '60 UC تركي',
                'price' => 0.8008000000000001,
            ],
            [
                'id' => 54,
                'name' => '325 UC تركي',
                'price' => 4.0768,
            ],
            [
                'id' => 56,
                'name' => '660 UC تركي',
                'price' => 8.164,
            ],
            [
                'id' => 57,
                'name' => '1800 UC تركي',
                'price' => 19.5208,
            ],
            [
                'id' => 58,
                'name' => '3850 UC تركي',
                'price' => 39.0104,
            ],
            [
                'id' => 59,
                'name' => '8100 UC تركي',
                'price' => 81.55680000000001,
            ],
            [
                'id' => 60,
                'name' => '60 UC عالمي',
                'price' => 0.8944,
            ],
            [
                'id' => 62,
                'name' => '325 UC عالمي',
                'price' => 4.4719999999999995,
            ],
            [
                'id' => 63,
                'name' => '660 UC عالمي',
                'price' => 9.0376,
            ],
            [
                'id' => 64,
                'name' => '1800 UC عالمي',
                'price' => 22.36,
            ],
            [
                'id' => 67,
                'name' => '8100 UC عالمي',
                'price' => 89.44,
            ],
            [
                'id' => 69,
                'name' => '340 مجوهرة',
                'price' => 2.496,
            ],
            [
                'id' => 70,
                'name' => '570 مجوهرة',
                'price' => 4.1704,
            ],
            [
                'id' => 71,
                'name' => '1166 مجوهرة',
                'price' => 8.3408,
            ],
            [
                'id' => 72,
                'name' => '2398 مجوهرة',
                'price' => 16.6816,
            ],
            [
                'id' => 81,
                'name' => '5150 يويو',
                'price' => 1.04,
            ],
            [
                'id' => 82,
                'name' => '14,200 يويو',
                'price' => 1.04,
            ],
            [
                'id' => 83,
                'name' => '41,080 يويو',
                'price' => 1.04,
            ],
            [
                'id' => 84,
                'name' => '164,680 يويو',
                'price' => 1.04,
            ],
            [
                'id' => 85,
                'name' => '300,000 يويو',
                'price' => 1.04,
            ],
            [
                'id' => 86,
                'name' => '650 لايف يو',
                'price' => 1.04,
            ],
            [
                'id' => 87,
                'name' => '1250 لايف يو',
                'price' => 1.04,
            ],
            [
                'id' => 88,
                'name' => '2500 لايف يو',
                'price' => 1.04,
            ],
            [
                'id' => 89,
                'name' => '5000 لايف يو',
                'price' => 1.04,
            ],
            [
                'id' => 90,
                'name' => '10,000 لايف يو',
                'price' => 1.04,
            ],
            [
                'id' => 91,
                'name' => '20,000 لايف يو',
                'price' => 1.04,
            ],
            [
                'id' => 92,
                'name' => '50,000 لايف يو',
                'price' => 1.04,
            ],
            [
                'id' => 99,
                'name' => 'بوبو لايف',
                'price' => 0.00010655736,
            ],
            [
                'id' => 101,
                'name' => 'ليت شات',
                'price' => 0.00018309824000000002,
            ],
            [
                'id' => 103,
                'name' => 'سوبر لايف',
                'price' => 0.0065081328,
            ],
            [
                'id' => 105,
                'name' => 'فانسي لايف',
                'price' => 0.00011555544,
            ],
            [
                'id' => 106,
                'name' => 'مرحبا شات',
                'price' => 1.5271671999999998e-5,
            ],
            [
                'id' => 108,
                'name' => '100 مجوهرة imo',
                'price' => 1.8096,
            ],
            [
                'id' => 109,
                'name' => '200 مجوهرة imo',
                'price' => 3.6296000000000004,
            ],
            [
                'id' => 110,
                'name' => '500 مجوهرة imo',
                'price' => 9.048,
            ],
            [
                'id' => 111,
                'name' => '1000 مجوهرة imo',
                'price' => 18.137600000000003,
            ],
            [
                'id' => 112,
                'name' => '2000 مجوهرة imo',
                'price' => 36.1712,
            ],
            [
                'id' => 113,
                'name' => '5000 مجوهرة imo',
                'price' => 90.49040000000001,
            ],
            [
                'id' => 120,
                'name' => '490 ميو Meyo',
                'price' => 5.1168000000000005,
            ],
            [
                'id' => 121,
                'name' => '980 ميو Meyo',
                'price' => 10.1816,
            ],
            [
                'id' => 122,
                'name' => '1960 ميو Meyo',
                'price' => 20.3632,
            ],
            [
                'id' => 123,
                'name' => '4900 ميو Meyo',
                'price' => 50.918400000000005,
            ],
            [
                'id' => 124,
                'name' => '9800 ميو Meyo',
                'price' => 101.83680000000001,
            ],
            [
                'id' => 143,
                'name' => 'كيو لايف',
                'price' => 0.00038207208,
            ],
            [
                'id' => 144,
                'name' => 'ميجو لايف',
                'price' => 0.000108446,
            ],
            [
                'id' => 159,
                'name' => 'هوني جار',
                'price' => 0.0080123264,
            ],
            [
                'id' => 166,
                'name' => 'توب توب',
                'price' => 0.00018745479999999999,
            ],
            [
                'id' => 167,
                'name' => 'وياك شات',
                'price' => 2.701296e-5,
            ],
            [
                'id' => 168,
                'name' => 'كواي لايف',
                'price' => 0.011123008,
            ],
            [
                'id' => 174,
                'name' => 'تادا شات',
                'price' => 0.0012644423999999999,
            ],
            [
                'id' => 175,
                'name' => 'تاكا لايف',
                'price' => 0.00010878712000000001,
            ],
            [
                'id' => 176,
                'name' => 'اكس زينا لايف',
                'price' => 0.0001108744,
            ],
            [
                'id' => 180,
                'name' => 'كرستال سولشيل',
                'price' => 0.0018374512,
            ],
            [
                'id' => 181,
                'name' => 'توكنز جواكر',
                'price' => 0.00011157878000000001,
            ],
            [
                'id' => 182,
                'name' => 'حيو شات',
                'price' => 0.00047706464,
            ],
            [
                'id' => 183,
                'name' => 'ايومي شات',
                'price' => 0.00097196216,
            ],
            [
                'id' => 184,
                'name' => '3850 UC عالمي',
                'price' => 44.72,
            ],
            [
                'id' => 185,
                'name' => 'بيغو لايف',
                'price' => 0.018245656000000002,
            ],
            [
                'id' => 189,
                'name' => 'هابي شات',
                'price' => 0.0004701632,
            ],
            [
                'id' => 207,
                'name' => 'سول شات',
                'price' => 0.0001614912,
            ],
            [
                'id' => 208,
                'name' => 'واهو لايف',
                'price' => 0.00010400000000000001,
            ],
            [
                'id' => 209,
                'name' => 'ديمو شات',
                'price' => 0.0009585253600000001,
            ],
            [
                'id' => 211,
                'name' => 'تامي شات',
                'price' => 7.5036104e-5,
            ],
            [
                'id' => 213,
                'name' => 'نبض لايف',
                'price' => 0.00017717232,
            ],
            [
                'id' => 214,
                'name' => 'يووي شات',
                'price' => 0.000100483136,
            ],
            [
                'id' => 217,
                'name' => 'جيمي  لايف',
                'price' => 0.00013866631999999999,
            ],
            [
                'id' => 220,
                'name' => 'سفن ستار',
                'price' => 0.00018086952000000002,
            ],
            [
                'id' => 222,
                'name' => 'ليلى شات',
                'price' => 0.00098113184,
            ],
            [
                'id' => 223,
                'name' => 'سلام شات',
                'price' => 9.9142056e-5,
            ],
            [
                'id' => 225,
                'name' => 'لودو غولدن',
                'price' => 0.00081889808,
            ],
            [
                'id' => 226,
                'name' => 'ديتتو لايف',
                'price' => 0.00027972048,
            ],
            [
                'id' => 228,
                'name' => 'يا اهلا',
                'price' => 0.0018705024000000002,
            ],
            [
                'id' => 230,
                'name' => 'سويو شات',
                'price' => 0.0009098866400000001,
            ],
            [
                'id' => 237,
                'name' => '69 Star Maker',
                'price' => 0.9152,
            ],
            [
                'id' => 239,
                'name' => 'بطاقة 5 $',
                'price' => 5.096000000000001,
            ],
            [
                'id' => 240,
                'name' => 'بطاقة 10 $',
                'price' => 10.192000000000002,
            ],
            [
                'id' => 241,
                'name' => 'بطاقة 20 $',
                'price' => 20.384000000000004,
            ],
            [
                'id' => 242,
                'name' => 'بطاقة 50 $',
                'price' => 50.96,
            ],
            [
                'id' => 244,
                'name' => 'اولاميت لايف',
                'price' => 0.0001536184,
            ],
            [
                'id' => 245,
                'name' => 'تانغو لايف',
                'price' => 0.0053858064,
            ],
            [
                'id' => 246,
                'name' => 'كوكو لايف',
                'price' => 0.00010452312,
            ],
            [
                'id' => 247,
                'name' => 'ويغو لايف',
                'price' => 0.00010216107200000001,
            ],
            [
                'id' => 249,
                'name' => 'USDT Trc20',
                'price' => 1.04,
            ],
            [
                'id' => 250,
                'name' => 'Payeer بايير',
                'price' => 1.04,
            ],
            [
                'id' => 251,
                'name' => 'بيرفيكت مني',
                'price' => 1.04,
            ],
            [
                'id' => 253,
                'name' => 'هوبي شات',
                'price' => 0.00017931056,
            ],
            [
                'id' => 254,
                'name' => 'عمار شات',
                'price' => 0.0075912408,
            ],
            [
                'id' => 255,
                'name' => 'سوغو شات',
                'price' => 0.0006099704000000001,
            ],
            [
                'id' => 256,
                'name' => 'مجلس شات',
                'price' => 0.0010721672,
            ],
        ];

        foreach ($games as $gameData) {
            $game = Game::create([
                'id' => $gameData['id'],
                'slug' => Str::slug($gameData['name']),
                'is_active' => true,
                'is_show' => true,
                'have_packages' => false,
                'need_name_player' => true,
                'need_id_player' => true,
                'price_qty' => $gameData['price'],
                'min_qty' => 1,
            ]);

            // Add translation
            GameTranslation::create([
                'locale' => 'ar',
                'game_id' => $game->id,
                'title' => $gameData['name'],
                'name_currency' => 'عملة',
            ]);
        }
    }
}
