
<?php

return [
    'categories'     => 'الفئات',
    'category'       => 'الفئة',
    'name'           => 'الاسم',
    'image'          => 'الصورة',
    'active'         => 'نشط',
    'created_at'     => 'تاريخ الإنشاء',
    'action'         => 'الإجراءات',

    // أزرار وعناوين
    'add'            => 'إضافة',
    'back'           => 'رجوع',
    'edit'           => 'تعديل',
    'delete'         => 'حذف',

    // مودال الحذف
    'titleDel'       => 'هل أنت متأكد من حذف',
    'save'           => 'حفظ',
    'cancel'         => 'إلغاء',
'view_products' => 'عرض المنتجات',
    // حالة عدم وجود بيانات
    'data_no_found'  => 'لا توجد بيانات',
];
